Revit 2026 API

# XYZItem Property

---

Indexed access to coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double this[
	int idx
] { get; }
```
```vb
Public ReadOnly Default Property Item (
	idx As Integer
) As Double
	Get
```
```cpp
public:
property double default[int idx] {
	double get (int idx);
}
```
```fsharp
member Item : float with get
```

#### Parameters

idx Int32
    Use 0 for X, 1 for Y and 2 for Z.

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when an attempt is made to access the coordinate with an index that is larger than 2. |

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace